// Підключаємо технологію express для back-end сервера
const express = require('express')
// Cтворюємо роутер - місце, куди ми підключаємо ендпоїнти
const router = express.Router()

// ================================================================

// router.get Створює нам один ентпоїнт

//           ↙ тут вводимо шлях (PATH) до сторінки
router.get('/', function (req, res) {
  // res.render генерує нам HTML сторінку

  //            ↙ cюди вводимо назву файлу з сontainer
  res.render('index', {
    layout: 'index',
    document: {
      logo: 'fa-solid fa-church fa-flip fa-lg',
      color: '#29e31c',
    },
    footer: [
      {
        text: '+380 66-36-90-26-0',
      },
      {
        text: 'email: timofijkisil030@gmail.com',
      },
      {
        text: 'Bible-Світ',
      },
    ],
  })
  //                  ↑↑ сюди вводимо JSON дані
})

// ================================================================

//              ↙ тут вводимо шлях (PATH) до сторінки
router.get('/test1', function (req, res) {
  //             ↙ cюди вводимо назву файлу з сontainer
  res.render('index', {
    layout: 'test',
    // ↙ сюди вводимо JSON дані

    title: 'Тест',
    num: '№1',
    zad1: [
      {
        num: '1',
        put: 'У якому вигляді Дух Святий зійшов на апостолів?',

        var: {
          var1: 'На війну з Єгиптом',
          var2: 'В обітовану землю',
          var3: 'В гості',
          var4: 'На прогулянку',
        },
      },
    ],
    zad2: [
      {
        num: '2',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },
    ],
    zad3: [
      {
        num: '3',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },
    ],
    zad4: [
      {
        num: '4',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },
    ],
    zad5: [
      {
        num: '5',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },
    ],
  })
})

// ================================================================

//              ↙ тут вводимо шлях (PATH) до сторінки
router.get('/test2', function (req, res) {
  //             ↙ cюди вводимо назву файлу з сontainer
  res.render('test2', {
    layout: 'index',
    // ↙ сюди вводимо JSON дані
    title: 'Тест',
    num: '№2',
    zad: [
      {
        num: '1.',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },

      {
        num: '2.',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },

      {
        num: '3.',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },

      {
        num: '4.',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },

      {
        num: '5.',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },

      {
        num: '6.',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },

      {
        num: '7.',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },

      {
        num: '8.',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },

      {
        num: '9.',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },

      {
        num: '10.',
        put: '?',

        var: {
          var1: 'A)',
          var2: 'B)',
          var3: 'C)',

          dopVar: {
            dopVar1: '...',
            dopVar2: '...',
            dopVar3: '...',
          },
        },
      },
    ],
  })
})

//=======================================================

// router.get Створює нам один ентпоїнт

//           ↙ тут вводимо шлях (PATH) до сторінки
router.get('/tests', function (req, res) {
  // res.render генерує нам HTML сторінку

  //            ↙ cюди вводимо назву файлу з сontainer
  res.render('tests', {
    layout: 'index',

    document: {
      logo: 'fa-solid fa-spell-check fa-bounce',
      color: 'red',
    },
    footer: [
      {
        text: '+380 66-36-90-26-0',
      },
      {
        text: 'email: timofijkisil030@gmail.com',
      },
      {
        text: 'Bible-Світ',
      },
    ],
  })
  //                  ↑↑ сюди вводимо JSON дані
})

// ================================================================

// router.get Створює нам один ентпоїнт

//           ↙ тут вводимо шлях (PATH) до сторінки
router.get('/biblemenu', function (req, res) {
  // res.render генерує нам HTML сторінку

  //            ↙ cюди вводимо назву файлу з сontainer
  res.render('bible', {
    layout: 'bible',

    documentHead: [
      {
        boockStart: true,
        number: 1,
        lesson: 1,
        location: '1:1-1:23',
        title: 'БУТТЯ',
        smallTitle: 'ПЕРША КНИГА МОЙСЕЄВА',
        column1: [
          {
            virsh: 'На початку Бог створив Небо та землю.',
          },
          {
            number: '2',
            virsh:
              'А земля була пуста та порожня, і темрява була над безоднею, і Дух Божий ширяв над поверхнею води.',
          },
          {
            number: '3',
            virsh:
              'І сказав Бог: "Хай станеться світло!" І сталося світло.',
          },
          {
            number: '4',
            virsh:
              'І побачив Бог світло, що добре воно, - і Бог відділив світло від темряви.',
          },
          {
            number: '5',
            virsh:
              'І Бог назвав світло "День", а темряву назвав "Ніч". І був вечір, і був ранок, - день перший.',
          },
          {
            number: '6',
            virsh:
              'І сказав Бог: "Нехай станеться твердь посеред води, і нехай вона відділяє між водою й водою".',
          },
          {
            number: '7',
            virsh:
              'І Бог твердь учинив, і відділив воду що під твердю вонаю І сталося так.',
          },
          {
            number: '8',
            virsh:
              'І назвав Бог твердь: "Небо". І був вечір, і був ранок, - день другий.',
          },
          {
            number: '9',
            virsh:
              'І сказав Бог: "Нехай збереться вода з-попід неба до місця одного, і нехай суходіл стане видний". І сталося так.',
          },
          {
            number: '10',
            virsh:
              'І назвав Бог суходіл: "Земля", а місце зібрання води назвав: "Море". І Бог побачив, що добре воно.',
          },
        ],

        column2: [
          {
            number: '11',
            virsh:
              'І сказав Бог: "Нехай земля вродить траву, ярину, що насіння вона розсіває, дерево овочеве, що за родом своїм плід приносить, що в ньому насіння його на землі". І сталося так.',
          },
          {
            number: '12',
            virsh:
              'І земля траву видала, ярину, що насіння розсіває за родом її, і дерево, що приносить плід, що насіння його в нім за родом його. І Бог побачив що добре воно.',
          },
          {
            number: '13',
            virsh:
              'І був вечір і був ранок, - день третій.',
          },
          {
            number: '14',
            virsh:
              'І сказав Бог: "Нехай будуть світила на тверді небесній для відділення дня від ночі, і нехай вони стануть знаками, і часами умовленими, і днями, і роками.',
          },
          {
            number: '15',
            virsh:
              'І нехай вони стануть на тверді небесній світилами, щоб світити над землею". І сталося так.',
          },
          {
            number: '16',
            virsh:
              'І вчинив Бог обидва світила великі, - світило велике, щоб воно керувало днем, і світило мале, щоб керувало ніччю, також зорі.',
          },
          {
            number: '17',
            virsh:
              'І Бог умістив їх на тверді небесній, щоб світили вони над землею.',
          },
          {
            number: '18',
            virsh:
              'і щоб керували днем та ніччю, і щоб відділювали світло від темряви. І Бог побачив, що це добре.',
          },
          {
            number: '19',
            virsh:
              'І був вечір, і був ранок, - день четвертий.',
          },
          {
            number: '20',
            virsh:
              'І сказав Бог: "нехай вода вироїть дрібні істоти, душу живу, і птаство, що літає над землею під небесною твердю".',
          },
          {
            number: '21',
            virsh:
              'І створив Бог риби великі, і всяку душу живу плазуючу, що її вода вироїла за їх родом, і всяку пташину крилату за родом її. І Бог побачив, що добре воно.',
          },
          {
            number: '22',
            virsh:
              'І поблагословив їх Бог кажучи: "Плодіться й розмножуйтеся, і наповнюйте воду в морях, а птаство нехай розмножується на землі!"',
          },
          {
            number: '23',
            virsh:
              "І був вечір, і був ранок, - день п'ятий.",
          },
        ],
      },

      {
        boockStart: false,
        number: 2,
        lesson: 1,
        location: '1:24-2:15',
        title: 'БУТТЯ',
        column1: [
          {
            number: '24',
            virsh:
              'І сказав Бог: "Нехай видасть земля живу душу за родом її, худобу й плазуюче, і земну звірину за родом її. І сталося так.',
          },
          {
            number: '25',
            virsh: '.',
          },
        ],

        column2: [],
      },
    ],
  })
  //                  ↑↑ сюди вводимо JSON дані
})

// ================================================================

// Підключаємо роутер до бек-енду
module.exports = router
